solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/tfa9xxx/fsl_tfa9xxx.c
/*
 * Copyright  2019 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*
 * fsl_tfa9xxx.c
 *
 *   General platform specific integration of tfa2_core code.
 */

#include "fsl_tfa9xxx.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define TFA9XXX_ROUND_DOWN(a, n)    (((a) / (n)) * (n))
#define TFA9XXX_I2C_MAX_DATA_LENGTH 256

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

status_t TFA9XXX_CreatePlatform(tfa9xxx_handle_t *handle, void *tfa_container_bin);
status_t TFA9XXX_PreStartConfigure(tfa9xxx_handle_t *handle);
void *TFA9XXX_GetI2CClient(nxpTfaContainer_t *cnt, uint8_t slaveAddress);
int TFA9XXX_DspExecuteCommand(
    struct tfa2_device *tfa, const char *cmd_buf, size_t cmd_len, char *res_buf, size_t res_len);
/*******************************************************************************
 * Variables
 ******************************************************************************/

/* tfa9xxx_device_t list */
static tfa9xxx_device_t s_devs[TFA9XXX_DEV_NUM];

/* profile index in container header file for the TFA to start */
static uint8_t s_TFA9XXX_start_profile = 0;

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief Initialize the TFA, put the TFA to operating state, allocate memory side.
 *
 * @param handle TFA9XXX handle structure.
 * @param tfa9xxxConfig TFA9XXX configuration structure.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_Init(tfa9xxx_handle_t *handle, tfa9xxx_config_t *tfa9xxxConfig)
{
    status_t rc;
    tfa9xxx_config_t *config = tfa9xxxConfig;
    handle->config           = config;

    TFA9XXX_Printf("==========================================================\n", __FUNCTION__);
    TFA9XXX_Printf("%s: TFA initialization starting...\n", __FUNCTION__);

    /* i2c bus initialization */
    if (CODEC_I2C_Init(&(handle->i2cHandle), config->i2cConfig.codecI2CInstance, TFA9XXX_I2C_BAUDRATE,
                       config->i2cConfig.codecI2CSourceClock) != kStatus_HAL_I2cSuccess)
    {
        return kStatus_Fail;
    }

    /*
     * instantiate and probe the device(s)
     */
    rc = TFA9XXX_CreatePlatform(handle, config->tfaContainer);
    if (rc != kStatus_Success)
    {
        TFA9XXX_Printf("%s: TFA create platform failed:\n", __FUNCTION__);
        return rc;
    }

    /* Reset TFA */
    rc = TFA9XXX_Reset(handle);
    if (rc != kStatus_Success)
    {
        TFA9XXX_Printf("%s: TFA reset failed:\n", __FUNCTION__);
        return rc;
    }

    /* Set calibration value */
    rc = TFA9XXX_PreStartConfigure(handle);
    if (rc != kStatus_Success)
    {
        TFA9XXX_Printf("%s: TFA pre-start configure failed:\n", __FUNCTION__);
        return rc;
    }

    /* Reset TFA */
    rc = TFA9XXX_Reset(handle);
    if (rc != kStatus_Success)
    {
        TFA9XXX_Printf("%s: TFA reset failed:\n", __FUNCTION__);
        return rc;
    }

    rc = TFA9XXX_Start(handle);
    if (rc != kStatus_Success)
    {
        TFA9XXX_Printf("%s: TFA start failed:\n", __FUNCTION__);
        return rc;
    }

    rc = TFA9XXX_SetMute(handle, false);
    if (rc != kStatus_Success)
    {
        TFA9XXX_Printf("%s: TFA set mute failed:\n", __FUNCTION__);
        return rc;
    }

    TFA9XXX_Printf("%s: TFA initialized successfully.\n", __FUNCTION__);
    TFA9XXX_Printf("==========================================================\n", __FUNCTION__);
    return rc;
}

/*!
 * @brief Deinitialize the TFA, put the TFA to powerdown state.
 *
 * @param handle The TFA codec handle.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_Deinit(tfa9xxx_handle_t *handle)
{
    status_t rc;
    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    rc = TFA9XXX_Reset(handle);
    if (rc != kStatus_Success)
        TFA9XXX_Printf("%s: TFA reset failed:\n", __FUNCTION__);

    return rc;
}

/*!
 * @brief Start the TFA.
 *
 * Start device will initialize if the device is in cold state
 * if already warm then only clocks will be started.
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle The TFA codec handle.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_Start(tfa9xxx_handle_t *handle)
{
    status_t rc;
    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    rc = tfa2_dev_start(&s_devs[handle->config->deviceIndex], s_TFA9XXX_start_profile, 0);

    return TFA9XXX_ConvertErrorCode(rc);
}

/*!
 * @brief Stop the TFA
 *
 * stop will put the TFA in powerdown/standby mode, the next time TFA start will be a warm start.
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle The TFA codec handle.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_Stop(tfa9xxx_handle_t *handle)
{
    status_t rc;
    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    rc = tfa2_dev_stop(&s_devs[handle->config->deviceIndex]);

    return TFA9XXX_ConvertErrorCode(rc);
}

/*!
 * @brief Reset the TFA
 *
 * Reset will put the in powerdown/standby mode, the next time TFA start will be a cold start.
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle The TFA codec handle.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_Reset(tfa9xxx_handle_t *handle)
{
    status_t rc;
    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    rc = tfa2_dev_set_state(&s_devs[handle->config->deviceIndex], TFA_STATE_RESET);

    return TFA9XXX_ConvertErrorCode(rc);
}

/*!
 * @brief Mute/Unmute the TFA
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle TFA9XXX handle structure.
 * @param isMute true is mute, false is unmute..
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_SetMute(tfa9xxx_handle_t *handle, bool isMute)
{
    status_t rc;
    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

