solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/tfa9xxx/fsl_tfa9xxx.c
    rc = tfa2_dev_mute(&s_devs[handle->config->deviceIndex], isMute);

    return TFA9XXX_ConvertErrorCode(rc);
}

/******************************device object creation ***********************/

/*!
 * @brief Create the platform that TFA relies on.
 *
 * this needs to be called once after powerup.
 * audio clocking is not required here, but may be running.
 *
 * @param handle The TFA codec handle.
 * @param tfa_container_bin The container bin contains the settings and binary files that are needed by TFA.
 *
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_CreatePlatform(tfa9xxx_handle_t *handle, void *tfa_container_bin)
{
    status_t rc;
    nxpTfaHeaderType_t type;
    struct nxpTfaContainer *cnt;

    tfa9xxx_device_t *tfa = &s_devs[handle->config->deviceIndex];

    /* verify if container file is valid */
    cnt  = (struct nxpTfaContainer *)tfa_container_bin;
    type = (nxpTfaHeaderType_t)HDR(cnt->id[0], cnt->id[1]);
    if (type != paramsHdr)
    { /* Load container file */
        TFA9XXX_Printf("%s: the container file is invalid\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }
    tfa->cnt = cnt;

    /* verify if slave address is valid */
    tfa->dev_idx = 0;
    tfa->i2c     = (struct i2c_client *)TFA9XXX_GetI2CClient(cnt, handle->config->slaveAddress);
    if (!tfa->i2c)
    {
        TFA9XXX_Printf("%s: Invalid slave address\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }
    tfa->i2c->hal = &(handle->i2cHandle);

    rc = tfa2_dev_probe(tfa);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: error probing device\n", __FUNCTION__);
        return TFA9XXX_ConvertErrorCode(rc);
    }
    if ((tfa->rev == 0x2a94) || (tfa->rev == 0x3a94))
    {
        /* bf_manstate overloads for TFA9894N2A0 and TFA9894N2A1*/
        tfa->bf_manstate = 0x1333;
    }
    tfa->dsp_execute = TFA9XXX_DspExecuteCommand;
    tfa->verbose     = 1U;

    return kStatus_Success;
}

/*!
 * @brief Configurate the TFA before starting by setting hardcoded calibration value for a new chip.
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle The TFA codec handle.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_PreStartConfigure(tfa9xxx_handle_t *handle)
{
    status_t rc;
    bool isTFACalibrated;
    tfa9xxx_device_t *tfa = &s_devs[handle->config->deviceIndex];

    rc = tfa2_i2c_write_bf(tfa->i2c, TFA9XXX_BF_PWDN, 0);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: Setting PWDN failed!\n", __FUNCTION__);
        return TFA9XXX_ConvertErrorCode(rc);
    }

    rc = tfa2_dev_clock_stable_wait(tfa);
    if (rc != kStatus_Success)
    {
        TFA9XXX_Printf("%s: TFA failed to power up.\n", __FUNCTION__);
        return rc;
    }

    rc = TFA9XXX_CheckCalibrationStatus(handle, &isTFACalibrated);
    if (rc != kStatus_Success)
    {
        TFA9XXX_Printf("%s: TFA check calibration status failed:\n", __FUNCTION__);
        return rc;
    }

    if (!isTFACalibrated)
    {
        TFA9XXX_Printf("%s: TFA is not calibrated, setting Calibration value...\n", __FUNCTION__);
        rc = TFA9XXX_HardcodeCalibrationValue(handle);
        if (rc != kStatus_Success)
        {
            TFA9XXX_Printf("%s: Setting Calibration value failed:\n", __FUNCTION__);
            return rc;
        }
    }
    else
    {
        TFA9XXX_Printf("%s: TFA is already calibrated, continue to start...\n", __FUNCTION__);
    }

    return rc;
}

/*!
 * @brief check if TFA is calibrated.
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle The TFA codec handle.
 * @param isTFACalibrated This value stores if TFA is calibrated.
 * @return status_t Returns kStatus_Success if operation is successfully, otherwise returns error code..
 */
status_t TFA9XXX_CheckCalibrationStatus(tfa9xxx_handle_t *handle, bool *isTFACalibrated)
{
    status_t rc;

    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    tfa9xxx_device_t *tfa = &s_devs[handle->config->deviceIndex];

    /* open key2 */
    rc = tfa2_i2c_hap_key2(tfa->i2c, 0);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: open key2 failed!\n", __FUNCTION__);
        goto exit;
    }
    /* check MTPEX, trigger CMTPI inside */
    rc = tfa2_dev_mtp_get(tfa, TFA_MTP_EX);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: check tfa calibration failed, cannot read MTPEX!\n", __FUNCTION__);
        goto exit;
    }
    else
    {
        *isTFACalibrated = rc;
        rc               = kStatus_Success;
    }

exit:
    /* close key2 */
    rc = tfa2_i2c_hap_key2(tfa->i2c, 1);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: close key2 failed!\n", __FUNCTION__);
    }

    return TFA9XXX_ConvertErrorCode(rc);
}

/*!
 * @brief Start Speakerboost Calibration.
 *
 * The calibration will measure speaker impedance, and calculate the speaker impedance at 25 degree.
 * This value will be used to estimate the real-time temperature.
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle The TFA codec handle.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_CalibrateSpeakerBoost(tfa9xxx_handle_t *handle)
{
    status_t rc;

    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    tfa9xxx_device_t *tfa = &s_devs[handle->config->deviceIndex];

    rc = tfa2_dev_mtp_set(tfa, TFA_MTP_OTC, 1);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: writing of MTPOTC failed!\n", __FUNCTION__);
        return TFA9XXX_ConvertErrorCode(rc);
    }

