solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/tfa9xxx/fsl_tfa9xxx.c
    rc = tfa2_dev_mtp_set(tfa, TFA_MTP_EX, 0);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: MTP set failed!\n", __FUNCTION__);
        return TFA9XXX_ConvertErrorCode(rc);
    }

    rc = tfa2_sb_calibrate(tfa);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: SpeakerBoost Calibration failed!\n", __FUNCTION__);
    }

    return TFA9XXX_ConvertErrorCode(rc);
}

/*!
 * @brief Hardcode calibration value for DSP usage instead of triggering calibration.
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle TFA9XXX handle structure.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_HardcodeCalibrationValue(tfa9xxx_handle_t *handle)
{
    status_t rc;
    uint16_t mtp_data_pre[16];
    uint8_t i;

    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    tfa9xxx_device_t *tfa = &s_devs[handle->config->deviceIndex];

    /* open key2 */
    tfa2_i2c_hap_key2(tfa->i2c, 0);

    /* open mtp */
    rc = tfa2_dev_mtp_set(tfa, TFA_MTP_OPEN, 1);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: writing of OPENMTP failed!\n", __FUNCTION__);
        goto exit;
    }

    // store original MTP data from  0xf0 ~ 0xff:
    rc = tfa2_i2c_write_bf(tfa->i2c, TFA9XXX_BF_CMTPI, 1);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: writing CMTPI failed!\n", __FUNCTION__);
        goto exit;
    }

    for (i = 0; i < 16U; i++)
    {
        rc = tfa2_i2c_read_reg(tfa->i2c, 0xF0U + i);
        if (rc < 0)
            goto exit;
        mtp_data_pre[i] = rc;
    }

    /* open MTP already called inside */
    rc = tfa2_dev_mtp_set(tfa, TFA_MTP_EX, 1);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: writing of MTPEX failed!\n", __FUNCTION__);
        goto exit;
    }
    rc = tfa2_dev_mtp_set(tfa, TFA_MTP_OTC, 1);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: writing of MTPOTC failed!\n", __FUNCTION__);
        goto exit;
    }
    /* hardcode 8 ohm (8*1024 = 8192 = 0x2000) */
    rc = tfa2_dev_mtp_set(tfa, TFA_MTP_R25C, 0x2000U);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: writing of R25C failed!\n", __FUNCTION__);
        goto exit;
    }

    for (i = 0; i < 16U; i++)
    {
        rc = tfa2_i2c_read_reg(tfa->i2c, 0xF0U + i);
        if (rc < 0)
            goto exit;
        if (i == 0)
        {
            if (rc != (mtp_data_pre[i] | 0x3U))
            {
                TFA9XXX_Printf("%s: !Unexpected MTP data change!\n", __FUNCTION__);
                goto exit;
            }
        }
        else if (i == 5U)
        {
            if (rc != 0x2000U)
            {
                TFA9XXX_Printf("%s: !Unexpected MTP data change!\n", __FUNCTION__);
                goto exit;
            }
        }
        else
        {
            if (rc != mtp_data_pre[i])
            {
                TFA9XXX_Printf("%s: !Unexpected MTP data change!\n", __FUNCTION__);
                goto exit;
            }
        }
    }

exit:
    /* close key2 */
    tfa2_i2c_hap_key2(tfa->i2c, 1);

    /* close mtp */
    rc = tfa2_dev_mtp_set(tfa, TFA_MTP_OPEN, 0);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: writing of OPENMTP failed!\n", __FUNCTION__);
    }

    return TFA9XXX_ConvertErrorCode(rc);
}

/*!
 * @brief Configure the TFA based on I2S format.
 * Assuming TFA_Init() is already called by calling CODEC_Init(), the TFA will be in operating state. So before calling
 * TFA_SetFormat(), the TFA needs to be in powerdown state by calling TFA_Stop().
 *
 * @param handle TFA codec handle.
 * @param mclk TFA by default uses BCK as external reference clock, mclk settings will be ignored here.
 * @param sampleRate The sample rates supported are 48000Hz, 44100Hz, 32000Hz and 16000Hz. By default, 48000Hz is used.
 * @param bitWidth The bit width.
 * @return Returns @ref kStatus_TFA98XX_Ok if success, otherwise returns error code.
 */
status_t TFA9XXX_ConfigDataFormat(tfa9xxx_handle_t *handle, uint32_t mclk, uint32_t sampleRate, uint32_t bitWidth)
{
    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    TFA9XXX_Printf("Function %s not supported yet\n", __FUNCTION__);
    return kStatus_Success;
}

/*!
 * @brief Set the volume level.
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle TFA codec handle.
 * @param volume volume value, support 0 ~ 100, 0 is mute, 100 is the maximum volume value.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_SetVolume(tfa9xxx_handle_t *handle, uint32_t volume)
{
    status_t rc;
    static const uint16_t VolumeTable[15] = {0, 1, 2, 4, 6, 10, 16, 24, 30, 40, 50, 60, 80, 100, 255};
    uint8_t index                         = 14 - volume / (100 / 14);

    //    uint8_t tfaVolume;

    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    if (volume > 100)
    {
        TFA9XXX_Printf("%s: volume out of range, should be 0 ~ 100\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    //    tfaVolume = (100 - volume) * 0xff / 100;

    rc = tfa2_i2c_write_bf_volatile(s_devs[handle->config->deviceIndex].i2c, TFA9XXX_BF_VOL, VolumeTable[index]);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: Setting volume failed!\n", __FUNCTION__);
    }

    return TFA9XXX_ConvertErrorCode(rc);
}

/*!
 * @brief Set the audio channel for a speaker.
 * By default, I2S channel is configured by the `.tfaContainer` in `tfa9xxx_config_t`. So you don't need to call this
 * function. However, if required, calling this function allows overwriting I2S channel selection. This can be useful
 * when the tuning is done, and you simply want to change the I2S channel.
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle TFA9XXX handle structure.
 * @param _codec_play_channel play channel, available values are kCODEC_PlayChannelLeft0, kCODEC_PlayChannelRight0,
 * kCODEC_PlayChannelLeft0 | kCODEC_PlayChannelRight0.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_SetPlayChannel(tfa9xxx_handle_t *handle, uint32_t playChannel)
{
    status_t rc;
    uint8_t channelCode = 0x01U;

