solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/tfa9xxx/fsl_tfa9xxx.c
    tfa9xxx_device_t *tfa = &s_devs[handle->config->deviceIndex];

    rc = tfa2_i2c_read_bf(tfa->i2c, tfa->bf_manstate);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: reading TFA status failed!\n", __FUNCTION__);
        return kStatus_Success;
    }
    else if (rc < 6)
    {
        TFA9XXX_Printf("%s: TFA not ready for setting channel, skip!\n", __FUNCTION__);
        return kStatus_Success;
    }

    if (playChannel == kTFA9XXX_PlayChannelLeft0)
    {
        channelCode = 0x0fU;
    }
    else if (playChannel == kTFA9XXX_PlayChannelRight0)
    {
        channelCode = 0xf1U;
    }
    else if (playChannel == (kTFA9XXX_PlayChannelLeft0 | kTFA9XXX_PlayChannelRight0))
    {
        channelCode = 0x01U;
    }
    else
    {
        TFA9XXX_Printf("%s: play channel unsupported!\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    char SetInputSelector_msg[]      = {0x00U, 0x80U, 0x06U, 0xffU, 0xffU, channelCode,
                                        0xffU, 0xffU, 0x32U, 0x00U, 0x0fU, 0xffU};
    uint8_t SetInputSelector_msg_len = 12U;

    rc = tfa2_cnt_write_msg(tfa, SetInputSelector_msg_len, SetInputSelector_msg);
    if (rc < 0)
    {
        TFA9XXX_Printf("%s: Writing Input Selector message failed!\n", __FUNCTION__);
    }

    return TFA9XXX_ConvertErrorCode(rc);
}

/*!
 * @brief Get the status of a running TFA.
 *
 * This function has dependency on internal structure, it has to be called after TFA9XXX_CreatePlatform();
 *
 * @param handle TFA codec handle.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
status_t TFA9XXX_GetStatus(tfa9xxx_handle_t *handle)
{
    status_t rc;
    if (!handle)
    {
        TFA9XXX_Printf("%s: TFA codec handle is NULL\n", __FUNCTION__);
        return kStatus_InvalidArgument;
    }

    rc = tfa2_dev_status(&s_devs[handle->config->deviceIndex]);

    return TFA9XXX_ConvertErrorCode(rc);
}

/*!
 * @brief Send command by i2c to TFA DSP to execute.
 *
 * Some long commands have to be chopped into little chunks to satisfy I2C limitation.
 *
 * @param tfa tfa device structure.
 * @param cmd_buf command buffer.
 * @param cmd_len command length.
 * @param res_buf result buffer.
 * @param res_len result length.
 * @return status_t Returns kStatus_Success if success, otherwise returns error code.
 */
int TFA9XXX_DspExecuteCommand(
    struct tfa2_device *tfa, const char *cmd_buf, size_t cmd_len, char *res_buf, size_t res_len)
{
    int rc = 0;
    uint32_t read_len;

    /* check write options */
    if (!cmd_len)
        return -EINVAL;

    if (res_len)
    {
        /* check read options */
        if (!res_buf)
            return -EINVAL;
        /* not 24bits aligned */
        if (res_len % 3)
            return -EFAULT;
    }

    /* if read is too big, do it afterwards in chunks */
    read_len = (res_len > TFA9XXX_I2C_MAX_DATA_LENGTH) ? 0 : res_len;

    /* if long message then send the payload in max sized chunks, fixup cmd_len */
    if (cmd_len > TFA9XXX_I2C_MAX_DATA_LENGTH)
    {
        /* handle write large messages */
        uint32_t chunk_size =
            TFA9XXX_ROUND_DOWN(TFA9XXX_I2C_MAX_DATA_LENGTH - 5 /*TODO dev->tfa->buffer_size*/, 3); /* XMEM word size */
        uint32_t xmem_offset = 2, remaining_bytes = cmd_len - 3; /* write all except the opcode/cmd_id */

        /* write in chunks */
        while ((rc == 0) && (remaining_bytes > 0))
        {
            if (remaining_bytes < chunk_size)
                chunk_size = remaining_bytes;
            /* else chunk_size remains at initialize value above */
            rc = tfa2_i2c_write_cf_mem24(tfa->i2c, xmem_offset, (uint8_t *)cmd_buf + xmem_offset * 3 - 3, chunk_size,
                                         TFA2_CF_MEM_XMEM);
            remaining_bytes -= chunk_size;
            xmem_offset += chunk_size / 3;
        }
        if (rc < 0)
            return rc;

        /* fake a 1 word cmd, the RPC payload is already there, only need the opcode now */
        cmd_len = 3;
    }
    /* and execute */
    rc = tfa2_i2c_dsp_execute(tfa, cmd_buf, cmd_len, res_buf, read_len);
    if (rc < 0)
        return rc;

    if (res_len > TFA9XXX_I2C_MAX_DATA_LENGTH)
    {
        /* handle write read messages */
        uint32_t chunk_size =
            TFA9XXX_ROUND_DOWN(TFA9XXX_I2C_MAX_DATA_LENGTH - 5 /*TODO dev->tfa->buffer_size*/, 3); /* XMEM word size */
        uint32_t xmem_offset = 0, remaining_bytes = res_len; /* write all except the opcode/cmd_id */

        /* write in chunks */
        while ((rc == 0) && (remaining_bytes > 0))
        {
            if (remaining_bytes < chunk_size)
                chunk_size = remaining_bytes;
            /* else chunk_size remains at initialize value above */
            rc = tfa2_i2c_read_cf_mem24(tfa->i2c, xmem_offset, (uint8_t *)res_buf + xmem_offset * 3, chunk_size,
                                        TFA2_CF_MEM_XMEM);
            remaining_bytes -= chunk_size;
            xmem_offset += chunk_size / 3;
        }
        if (rc < 0)
            return rc;
    }

    return rc;
}
